src/Catalogs/СтатьиДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтатьиДДС</Name>
			<Comment>Статьи движения денежных средств</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондирующий счет бухгалтерского учета</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатьиДДС/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Статьи ДДС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"),,);
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Имя, Наименование, Код, ВидДвижения, КоррСчет
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрВидДвижения = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрКоррСчет = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		
		// берем предопределенный элемент
		ПредопределеннаяСтатья = Справочники.СтатьиДДС[СтрИмя];
		
		Если ПредопределеннаяСтатья.Пустая() Тогда
			ВывестиСообщение(НСтр("ru='Ошибка при заполнении справочника: ""%1"" . Указан отсутствующий элемент справочника СтатьиДДС.'"),,,,,СтрНаименование);
			Продолжить;
		КонецЕсли;
		
		ПредопределеннаяСтатьяОбъект = ПредопределеннаяСтатья.ПолучитьОбъект();
		
		// перезаполняем реквизиты
		ПредопределеннаяСтатьяОбъект.Наименование = СтрНаименование;
		Если ЗначениеЗаполнено(СтрВидДвижения) Тогда
			СсылкаВидДвижения = Перечисления.ВидыДвижений[СтрВидДвижения];
			Если СсылкаВидДвижения.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи ДДС элемента: ""%1"". Вид движения: ""%2"" не найден'"),,,,,СтрНаименование,СтрВидДвижения);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.ВидДвижения) Тогда
					ПредопределеннаяСтатьяОбъект.ВидДвижения = СсылкаВидДвижения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрКоррСчет) Тогда
			СсылкаКоррСчет = ПланыСчетов.Регламентированный[СтрКоррСчет];
			Если СсылкаКоррСчет.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи ДДС элемента: ""%1"". Корреспондирующий счет: ""%2"" не найден'"),,,,,СтрНаименование,СтрКоррСчет);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.КоррСчет) Тогда
					ПредопределеннаяСтатьяОбъект.КоррСчет = СсылкаКоррСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Сохранение справочника
		НовыйЭлемент = ПредопределеннаяСтатьяОбъект.ЭтоНовый();
		Если ПредопределеннаяСтатьяОбъект.Модифицированность() Тогда
			Попытка
				ПредопределеннаяСтатьяОбъект.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Статьи ДДС"". ""%1"" элемент  ""%2""'"),,,,,?(НовыйЭлемент,"Добавлен","Обновлен"),СокрЛП(ПредопределеннаяСтатьяОбъект.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Статьи ДДС""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ВидДвижения");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
